CSI API ETABS v1
cDCompColAISC360_22.SetOverwrite Method
 Sets the value of a composite column design overwrite item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOverwrite(
	string Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType.Objects
)
Function SetOverwrite (
	Name As String,
	Item As Integer,
	Value As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDCompColAISC360_22
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetOverwrite(Name,
	Item, Value, ItemType)
int SetOverwrite(
	String^ Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType::Objects
)
abstract SetOverwrite :
        Name : string *
        Item : int *
        Value : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
Item
Type: System.Int32
 This is an integer between 1 and 23, inclusive, indicating the overwrite item considered.
Live load reduction factor
Unbraced length ratio, Major
Unbraced length ratio, Minor
Effective length factor, K1 Major
Effective length factor, K1 Minor
Effective length factor, K2 Major
Effective length factor, K2 Minor
Moment coefficient, Cm Major
Moment coefficient, Cm Minor
Nonsway moment factor, B1 Major
Nonsway moment factor, B1 Minor
Sway moment factor, B2 Major
Sway moment factor, B2 Minor
Reduce HSS thickness
HSS welding type
Yield stress, Fy
Expected to specified Fy ratio, Ry
Compressive capacity, Pnc
Tensile capacity, Pnt
Major bending capacity, Mn3
Minor bending capacity, Mn2
Major shear capacity, Vn2
Minor shear capacity, Vn3
Value
Type: System.Double
 The value of the considered overwrite item.
 Live load reduction factor
 Value >= 0; 0 means use program determined value.
 Unbraced length ratio, Major
 Value >= 0; 0 means use program determined value.
 Unbraced length ratio, Minor
 Value >= 0; 0 means use program determined value.
 Effective length factor, K1 Major
 Value >= 0; 0 means use program determined value.
 Effective length factor, K1 Minor
 Value >= 0; 0 means use program determined value.
 Effective length factor, K2 Major
 Value >= 0; 0 means use program determined value.
 Effective length factor, K2 Minor
 Value >= 0; 0 means use program determined value.
 Moment coefficient, Cm Major
 Value >= 0; 0 means use program determined value.
 Moment coefficient, Cm Minor
 Value >= 0; 0 means use program determined value.
 Nonsway moment factor, B1 Major
 Value >= 0; 0 means use program determined value.
 Nonsway moment factor, B1 Minor
 Value >= 0; 0 means use program determined value.
 Sway moment factor, B2 Major
 Value >= 0; 0 means use program determined value.
 Sway moment factor, B2 Minor
 Value >= 0; 0 means use program determined value.
 Reduce HSS thickness
0 = Program Default
1 = No
2 = Yes
 HSS welding type
0 = Program Default
1 = ERW
2 = SAW
 Yield stress, Fy
 Value >= 0; 0 means use program determined value. [F/L^2]
 Expected to specified Fy ratio, Ry
 Value >= 0; 0 means use program determined value.
 Compressive capacity, Pnc
 Value >= 0; 0 means use program determined value. [F]
 Tensile capacity, Pnt
 Value >= 0; 0 means use program determined value. [F]
 Major bending capacity, Mn3
 Value >= 0; 0 means use program determined value. [FL]
 Minor bending capacity, Mn2
 Value >= 0; 0 means use program determined value. [FL]
 Major shear capacity, Vn2
 Value >= 0; 0 means use program determined value. [F]
 Minor shear capacity, Vn3
 Value >= 0; 0 means use program determined value. [F]
 Demand/capacity ratio limit
 Value >= 0; 0 means use program determined value.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the item is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignCompositeColumn.SetCode("AISC 360-22")
'set overwrite item
   ret = SapModel.DesignCompositeColumn.AISC360_22.SetOverwrite("8", 1, 7)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCompColAISC360_22 Interface
ETABSv1 Namespace